Repository: anselmobd/tuple-load
Catalog: po/*/LC_MESSAGES/tuple-load.po
Languages: pt_br

source: {} file: {}
pt_br: arquivo {}: {}

source: file does not exist
pt_br: arquivo não existe

source: For now, script prepared only for Oracle.
pt_br: Por ora o script só está preparado para Oracle

source: Database connected. (Oracle version: {})
pt_br: Banco de dados conectado. (versão do Oracle: {})

source: Write CSV data to Oracle table
pt_br: Importa dados de um CSV para uma tabela do Oracle

source: data group CSV file name, in the format data_group_name[.version].csv
pt_br: nome do CSV de um grupo de dados, no formato nome_do_grupo_de_dados[.versão].csv

source: config file of data groups and database access
pt_br: arquivo de configuração de grupos de dados e acesso à banco de dados

source: default directory for CSV files
pt_br: diretório padrão para arquivos CSV

source: default directory for table access definitions (TAD) in JOSN format
pt_br: diretório padrão para arquivos de definições de acesso à tabelas (TAD) no formato JSON

source: default directory for table access definitions in YAML format
pt_br: diretório padrão para arquivos de definições de acesso à tabelas no formato YAML

source: use YAML format file for table access definitions (default)
pt_br: usa formato YAML para os arquivos de definições de acesso à tabelas (padrão)

source: use JOSN format file for table access definitions
pt_br: usa formato JSON para os arquivos de definições de acesso à tabelas

source: insert or update in Oracle rows in CSV (default if none action defined)
pt_br: insert ou update no Oracle das linhas no CSV (padrão, se nenhuma ação for definida)

source: (same as -i)
pt_br: (mesmo que -i)

source: delete in Oracle rows not in CSV
pt_br: delete no Oracle linhas que não estão no CSV

source: force -i and -d
pt_br: força -i e -d

source: increase output verbosity
pt_br: aumenta a verbosidade

source: Data group name: %s
pt_br: Nome do grupo de dados: %s

source: SQL Table name: %s
pt_br: Nome da tabela SQL: %s

source: Table access definitions file name: %s
pt_br: Nome do arquivo de definição de acesso à tabelas: %s

source: count = %s
pt_br: contador = %s

source: updated: %s
pt_br: atualizado: %s

source: inserted: %s
pt_br: inserido: %s

source: deleted: %s
pt_br: apagado: %s
